//This is an example code for Bottom Navigation//
import React from 'react';
import {Image} from 'react-native';
//import react in our code.
import {Text, View, TouchableOpacity, StyleSheet} from 'react-native';
//import all the basic component we have used

export default class SettingsScreen extends React.Component {
  //Setting Screen to show in Setting Option
  render() {
    return (
      <View>
        <Text>
          วิสาหกิจชุมชนกลุ่มอนุรักษ์ป่าชายเลนบ้านแหลมโฮมสเตย์ รายละเอียด :
          แหล่งท่องเที่ยวแห่งเดียวที่มีจุดเด่นที่สุดในประเทศ
          ที่มีการสปาโคลนสดในทะเล
          ประวัติกลุ่มอนุรักษ์ป่าชายเลนบ้านแหลมโฮมสเตย์ตั้งอยู่ที่ หมู่ 7
          ต.ท่าศาลา อ.ท่าศาลา
          จ.นครศรีธรรมราชลักษณะของพื้นที่มีส่วนของผืนดินที่งอกยื่นลงไปในทะเลโดยมีขนาดของพื้นที่เพิ่มขึ้นทุกปี
          โดยมีพื้นที่ มีขนาดเพิ่มขึ้น ทางชาวบ้าน องค์กร หน่วยงาน และนักเรียน
          นักศึกษา
          ได้มีการร่วมกันในการปลูกป่าชายเลนอยู่ทุกๆปีโดยมีการเลือกพันธุ์โกงกางลำพูต้นจากและตลอดจนพันธุ์พืชที่สามารถเจริญงอกงามได้ดีในพื้นที่น้ำกร่อยได้มีการขยายพื้นที่ปลูกอยู่ตลอดทุกปีโดยมีพื้นที่รวมโดยประมาณ
          5000 กว่าไร่ และมีแนวโน้มเพิ่มขึ้นทุกปี โดยอยู่ในพื้นที่ ของ หมู่ 7
          และ หมู่ 14 ต.ท่าศาลา อ.ท่าศาลา จ.นครศรีธรรมราช
          ด้วยลักษณะพื้นที่ดังกล่าวทำให้ชาวบ้านได้รับประโยชน์เป็นแหล่งอาหารเป็นที่อยู่อาศัยของพืชและสัตว์ตามธรรมชาติเพื่อเป็นตัวช่วยป้องกันการกัดเซาะตามแนวชายฝั่งทะเลจาก
          ป่าโกงกางที่มีส่วนเพิ่มขึ้นทุกปีโดยพื้นที่ดังกล่าวเป็นแหล่งขยายพันธุ์สัตว์น้ำให้กับชาวบ้านในพื้นที่สามารถที่จะมีพันธุ์ปลาเพื่อเป็นแหล่งอาหารตลอดจนสามารถสร้างรายได้ให้กับครอบครัว
          ได้เป็นอย่างดีทั้งนี้ด้วยประโยชน์ของป่าชายเลนที่มีต่อชุมชนต่อชาวบ้านที่สามารถใช้ประ...
        </Text>
      </View>
    );
  }
}
const styles = StyleSheet.create({
  button: {
    alignItems: 'center',
    backgroundColor: '#DDDDDD',
    padding: 10,
    width: 300,
    marginTop: 16,
  },
});
